## Flight Price Prediction (EDA and Feature Engineering)

In [1]:
# Importing important libraries

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
# Loading data sets.

df_train = pd.read_excel('D:\\Study\\Data Science and Machine Learning\\Krish Naik\\Live EDA\\Flight Delay Data Set\\Data_Train.xlsx')
df_test = pd.read_excel('D:\\Study\\Data Science and Machine Learning\\Krish Naik\\Live EDA\\Flight Delay Data Set\\Test_set.xlsx')

In [3]:
# Checking the shape of both train and test data sets:

print('train data set shape:', df_train.shape)
print('\n')
print('test data set shape:', df_test.shape)

train data set shape: (10683, 11)


test data set shape: (2671, 10)

In [4]:
# Merging both the data set.

final_df = df_train.append(df_test)

C:\Users\Shivam Dwivedi\AppData\Local\Temp\ipykernel_8672\708414381.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  final_df = df_train.append(df_test)

In [5]:
# Checking the shape of the final_df.

final_df.shape

(13354, 11)

In [6]:
# Checking the top 5 rows of the data set.

final_df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662.0
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882.0
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218.0
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302.0

In [7]:
# Checking last 5 rows of the data set.

final_df.tail()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
2666,Air India,6/06/2019,Kolkata,Banglore,CCU → DEL → BLR,20:30,20:25 07 Jun,23h 55m,1 stop,No info,NaN
2667,IndiGo,27/03/2019,Kolkata,Banglore,CCU → BLR,14:20,16:55,2h 35m,non-stop,No info,NaN
2668,Jet Airways,6/03/2019,Delhi,Cochin,DEL → BOM → COK,21:50,04:25 07 Mar,6h 35m,1 stop,No info,NaN
2669,Air India,6/03/2019,Delhi,Cochin,DEL → BOM → COK,04:00,19:15,15h 15m,1 stop,No info,NaN
2670,Multiple carriers,15/06/2019,Delhi,Cochin,DEL → BOM → COK,04:55,19:15,14h 20m,1 stop,No info,NaN

In [8]:
# Checking the info of the data set.

final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13354 entries, 0 to 2670
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13354 non-null  object
 1   Date_of_Journey  13354 non-null  object
 2   Source           13354 non-null  object
 3   Destination      13354 non-null  object
 4   Route            13353 non-null  object
 5   Dep_Time         13354 non-null  object
 6   Arrival_Time     13354 non-null  object
 7   Duration         13354 non-null  object
 8   Total_Stops      13353 non-null  object
 9   Additional_Info  13354 non-null  object
 10  Price            10683 non-null  float64
dtypes: float64(1), object(10)
memory usage: 1.2+ MB

In [9]:
# Checking null values in the data set.

final_df.isnull().sum()

Airline               0
Date_of_Journey       0
Source                0
Destination           0
Route                 1
Dep_Time              0
Arrival_Time          0
Duration              0
Total_Stops           1
Additional_Info       0
Price              2671
dtype: int64

## Feature Engineering Process

In [10]:
# Splitting Data, Month and Year from 'Date_of_Journey'.

final_df['Date'] = final_df['Date_of_Journey'].str.split('/').str[0]
final_df['Month'] = final_df['Date_of_Journey'].str.split('/').str[1]
final_df['Year'] = final_df['Date_of_Journey'].str.split('/').str[2]

In [11]:
## Another technique or code for splitting the Date of Journey column in 'Date', 'Month' and 'Year'

# final_df['Date'] = final_df['Date_of_Journey'].apply(lambda x:x.split("/")[0])
# final_df['Month'] = final_df['Date_of_Journey'].apply(lambda x:x.split("/")[1])
# final_df['Year'] = final_df['Date_of_Journey'].apply(lambda x:x.split("/")[2])

In [12]:
# Checking the newly made columns in the data set.

final_df.head(2)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0,24,03,2019
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662.0,1,05,2019

In [13]:
# Converting the data type of columns 'Date', 'Month', and 'Year' from object to int.

final_df['Date'] = final_df['Date'].astype(int)
final_df['Month'] = final_df['Month'].astype(int)
final_df['Year'] = final_df['Year'].astype(int)

In [14]:
# Dropping the 'Date_of_Journey' column from the data set.

final_df.drop('Date_of_Journey',axis=1,inplace=True)

In [15]:
# Splitting the date and day from 'Arrival_Time' column.

#final_df['Arrival_Time'] = final_df['Arrival_Time'].str.split(' ').str[0]
#final_df['Arrival_Time']

In [16]:
# Another code to split the date and day from 'Arrival_Time' column.

final_df['Arrival_Time'] = final_df['Arrival_Time'].apply(lambda x : x.split(' ')[0])
final_df['Arrival_Time']

0       01:10
1       13:15
2       04:25
3       23:30
4       21:35
        ...
2666    20:25
2667    16:55
2668    04:25
2669    19:15
2670    19:15
Name: Arrival_Time, Length: 13354, dtype: object

In [17]:
# Splitting the 'Arrival Time' column into hours and minutes.

final_df['Arrival_Hour'] = final_df['Arrival_Time'].apply(lambda x : x.split(':')[0])
final_df['Arrival_Min'] = final_df['Arrival_Time'].apply(lambda x : x.split(':')[1])
print(final_df['Arrival_Hour'])
print('\n')
print(final_df['Arrival_Min'])

0       01
1       13
2       04
3       23
4       21
        ..
2666    20
2667    16
2668    04
2669    19
2670    19
Name: Arrival_Hour, Length: 13354, dtype: object


0       10
1       15
2       25
3       30
4       35
        ..
2666    25
2667    55
2668    25
2669    15
2670    15
Name: Arrival_Min, Length: 13354, dtype: object

In [18]:
final_df.columns

Index(['Airline', 'Source', 'Destination', 'Route', 'Dep_Time', 'Arrival_Time',
       'Duration', 'Total_Stops', 'Additional_Info', 'Price', 'Date', 'Month',
       'Year', 'Arrival_Hour', 'Arrival_Min'],
      dtype='object')

In [19]:
# Converting the datatype of "Arrival_Hour" and "Arrival_Min" from object to int.

final_df['Arrival_Hour'] = final_df['Arrival_Hour'].astype(int)
final_df['Arrival_Min'] = final_df['Arrival_Min'].astype(int)

In [20]:
# Dropping the 'Arrival_Time' column from the dataset..

final_df.drop('Arrival_Time',axis=1,inplace=True)

In [21]:
# Splitting the "Dep_Time" into 'Departure_Hour' and 'Departure_Min'.

final_df['Departure_Hour'] = final_df['Dep_Time'].apply(lambda x : x.split(':')[0])
print('final_df[Departure_Hour]: \n', final_df['Departure_Hour'])
print('\n')
final_df['Departure_Min'] = final_df['Dep_Time'].apply(lambda x : x.split(':')[1])
print('final_df[Departure_Min]: \n',final_df['Departure_Min'])

final_df[Departure_Hour]:
 0       22
1       05
2       09
3       18
4       16
        ..
2666    20
2667    14
2668    21
2669    04
2670    04
Name: Departure_Hour, Length: 13354, dtype: object


final_df[Departure_Min]:
 0       20
1       50
2       25
3       05
4       50
        ..
2666    30
2667    20
2668    50
2669    00
2670    55
Name: Departure_Min, Length: 13354, dtype: object

In [22]:
# Converting the data type of Departure_Hour and Departure_Min from object to int.

final_df['Departure_Hour'] = final_df['Departure_Hour'].astype(int)
final_df['Departure_Min'] = final_df['Departure_Min'].astype(int)

In [23]:
# Dropping the Dep_Time Column from the data set.

final_df.drop('Dep_Time',axis=1,inplace=True)

In [24]:
final_df.columns

Index(['Airline', 'Source', 'Destination', 'Route', 'Duration', 'Total_Stops',
       'Additional_Info', 'Price', 'Date', 'Month', 'Year', 'Arrival_Hour',
       'Arrival_Min', 'Departure_Hour', 'Departure_Min'],
      dtype='object')

In [25]:
# Checking the unique values in the Total_Stops column.

final_df['Total_Stops'].unique()

array(['non-stop', '2 stops', '1 stop', '3 stops', nan, '4 stops'],
      dtype=object)

In [26]:
# Encoding the categorical values by using map function.

final_df['Total_Stops'] = final_df['Total_Stops'].map({'non-stop':0,'1 stop':1, '2 stops':2, '3 stops':3, '4 stops':4, 'nan':2})

In [27]:
# Checking the row of null value of Total_Stops.

final_df[final_df['Total_Stops'].isnull()]

,Airline,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_Hour,Arrival_Min,Departure_Hour,Departure_Min
9039,Air India,Delhi,Cochin,NaN,23h 40m,NaN,No info,7480.0,6,5,2019,9,25,9,45

In [28]:
# Checking the top 5 rows of the data set again.

final_df.head(2)

,Airline,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_Hour,Arrival_Min,Departure_Hour,Departure_Min
0,IndiGo,Banglore,New Delhi,BLR → DEL,2h 50m,0.0,No info,3897.0,24,3,2019,1,10,22,20
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,7h 25m,2.0,No info,7662.0,1,5,2019,13,15,5,50

In [29]:
# Dropping the 'Route' column from the data set.

final_df.drop('Route',axis=1,inplace=True)

In [30]:
# Checking the Duration Column and splitting the Duration into Duration_Hour and Duration_Min

final_df['Duration_Hour'] = final_df['Duration'].str.split(' ').str[0].str.split('h').str[0]
print(final_df['Duration_Hour'])
print('\n')
#final_df['Duration_Min'] = final_df['Duration'].str.split(' ').str[1].str.split('m').str[0]
#print(final_df['Duration_Min'])

0        2
1        7
2       19
3        5
4        4
        ..
2666    23
2667     2
2668     6
2669    15
2670    14
Name: Duration_Hour, Length: 13354, dtype: object

In [31]:
final_df.columns

Index(['Airline', 'Source', 'Destination', 'Duration', 'Total_Stops',
       'Additional_Info', 'Price', 'Date', 'Month', 'Year', 'Arrival_Hour',
       'Arrival_Min', 'Departure_Hour', 'Departure_Min', 'Duration_Hour'],
      dtype='object')

In [38]:
# Finding the anamoly ('5m') in the 'Duration_Hour' column and dropping the row.

final_df[final_df['Duration_Hour']=='5m']

,Airline,Source,Destination,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_Hour,Arrival_Min,Departure_Hour,Departure_Min,Duration_Hour
6474,Air India,Mumbai,Hyderabad,5m,2.0,No info,17327.0,6,3,2019,16,55,16,50,5m
2660,Air India,Mumbai,Hyderabad,5m,2.0,No info,NaN,12,3,2019,16,55,16,50,5m

In [39]:
# Dropping the rows 6474 and 2660.

final_df.drop(6474,axis=0,inplace=True)
final_df.drop(2660, axis=0, inplace=True)

In [40]:
# Changing the data type of final_df['Duration_Hour'] to int and converting it to minutes by multiplying it by 60.
 
final_df['Duration_Hour'] = final_df['Duration_Hour'].astype(int)

In [41]:
# Dropping the 'Duration' column.

final_df.drop('Duration',axis=1,inplace=True)

In [42]:
final_df.columns

Index(['Airline', 'Source', 'Destination', 'Total_Stops', 'Additional_Info',
       'Price', 'Date', 'Month', 'Year', 'Arrival_Hour', 'Arrival_Min',
       'Departure_Hour', 'Departure_Min', 'Duration_Hour'],
      dtype='object')

In [43]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13351 entries, 0 to 2670
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13351 non-null  object
 1   Source           13351 non-null  object
 2   Destination      13351 non-null  object
 3   Total_Stops      13350 non-null  float64
 4   Additional_Info  13351 non-null  object
 5   Price            10681 non-null  float64
 6   Date             13351 non-null  int32
 7   Month            13351 non-null  int32
 8   Year             13351 non-null  int32
 9   Arrival_Hour     13351 non-null  int32
 10  Arrival_Min      13351 non-null  int32
 11  Departure_Hour   13351 non-null  int32
 12  Departure_Min    13351 non-null  int32
 13  Duration_Hour    13351 non-null  int32
dtypes: float64(2), int32(8), object(4)
memory usage: 1.1+ MB

In [44]:
# Checking the data types of the dataframe.

final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13351 entries, 0 to 2670
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13351 non-null  object
 1   Source           13351 non-null  object
 2   Destination      13351 non-null  object
 3   Total_Stops      13350 non-null  float64
 4   Additional_Info  13351 non-null  object
 5   Price            10681 non-null  float64
 6   Date             13351 non-null  int32
 7   Month            13351 non-null  int32
 8   Year             13351 non-null  int32
 9   Arrival_Hour     13351 non-null  int32
 10  Arrival_Min      13351 non-null  int32
 11  Departure_Hour   13351 non-null  int32
 12  Departure_Min    13351 non-null  int32
 13  Duration_Hour    13351 non-null  int32
dtypes: float64(2), int32(8), object(4)
memory usage: 1.1+ MB

In [45]:
# Checking the columns of the dataset.

final_df.columns

Index(['Airline', 'Source', 'Destination', 'Total_Stops', 'Additional_Info',
       'Price', 'Date', 'Month', 'Year', 'Arrival_Hour', 'Arrival_Min',
       'Departure_Hour', 'Departure_Min', 'Duration_Hour'],
      dtype='object')

In [46]:
# Printing unique values of 'Airline' column.

final_df['Airline'].unique()

array(['IndiGo', 'Air India', 'Jet Airways', 'SpiceJet',
       'Multiple carriers', 'GoAir', 'Vistara', 'Air Asia',
       'Vistara Premium economy', 'Jet Airways Business',
       'Multiple carriers Premium economy', 'Trujet'], dtype=object)

In [47]:
# Making dataframe consisting of only categorical variables.

final_df1 = final_df.select_dtypes(exclude=['int', 'float'])
final_df1.head()

       Airline    Source Destination Additional_Info
0       IndiGo  Banglore   New Delhi         No info
1    Air India   Kolkata    Banglore         No info
2  Jet Airways     Delhi      Cochin         No info
3       IndiGo   Kolkata    Banglore         No info
4       IndiGo  Banglore   New Delhi         No info

In [48]:
# Checking unique categories of the categorical columns before encoding.

for col in final_df1.columns:
    print('Unique Categories of column {} are :\n {}'.format(col,final_df1[col].unique())) 
    print('The value counts of column {} are :\n {}'.format(col, final_df1[col].value_counts())) 
    print('\n')

Unique Categories of column Airline are :
 ['IndiGo' 'Air India' 'Jet Airways' 'SpiceJet' 'Multiple carriers' 'GoAir'
 'Vistara' 'Air Asia' 'Vistara Premium economy' 'Jet Airways Business'
 'Multiple carriers Premium economy' 'Trujet']
The value counts of column Airline are :
 Jet Airways                          4745
IndiGo                               2564
Air India                            2190
Multiple carriers                    1543
SpiceJet                             1026
Vistara                               608
Air Asia                              405
GoAir                                 240
Multiple carriers Premium economy      16
Jet Airways Business                    8
Vistara Premium economy                 5
Trujet                                  1
Name: Airline, dtype: int64


Unique Categories of column Source are :
 ['Banglore' 'Kolkata' 'Delhi' 'Chennai' 'Mumbai']
The value counts of column Source are :
 Delhi       5681
Kolkata     3581
Banglore    2752
Mumbai       881
Chennai      456
Name: Source, dtype: int64


Unique Categories of column Destination are :
 ['New Delhi' 'Banglore' 'Cochin' 'Kolkata' 'Delhi' 'Hyderabad']
The value counts of column Destination are :
 Cochin       5681
Banglore     3581
Delhi        1582
New Delhi    1170
Hyderabad     881
Kolkata       456
Name: Destination, dtype: int64


Unique Categories of column Additional_Info are :
 ['No info' 'In-flight meal not included' 'No check-in baggage included'
 '1 Short layover' 'No Info' '1 Long layover' 'Change airports'
 'Business class' 'Red-eye flight' '2 Long layover']
The value counts of column Additional_Info are :
 No info                         10490
In-flight meal not included      2426
No check-in baggage included      396
1 Long layover                     20
Change airports                     8
Business class                      5
No Info                             3
1 Short layover                     1
Red-eye flight                      1
2 Long layover                      1
Name: Additional_Info, dtype: int64

In [49]:
# Importing LabelEncoder from sklearn.preprocessing

from sklearn.preprocessing import LabelEncoder
labelencoder = LabelEncoder()

In [50]:
# Performing labelencoder on categorical features of the data set.

for col in final_df1.columns:
    final_df1[col] = labelencoder.fit_transform(final_df[col])

In [51]:
# Checking the unique values and count after label encoding.

for col in final_df1.columns:
    print('Unique Categories of column {} are :\n {}'.format(col,final_df1[col].unique())) 
    print('The value counts of column {} are :\n {}'.format(col, final_df1[col].value_counts())) 
    print('\n')

Unique Categories of column Airline are :
 [ 3  1  4  8  6  2 10  0 11  5  7  9]
The value counts of column Airline are :
 4     4745
3     2564
1     2190
6     1543
8     1026
10     608
0      405
2      240
7       16
5        8
11       5
9        1
Name: Airline, dtype: int64


Unique Categories of column Source are :
 [0 3 2 1 4]
The value counts of column Source are :
 2    5681
3    3581
0    2752
4     881
1     456
Name: Source, dtype: int64


Unique Categories of column Destination are :
 [5 0 1 4 2 3]
The value counts of column Destination are :
 1    5681
0    3581
2    1582
5    1170
3     881
4     456
Name: Destination, dtype: int64


Unique Categories of column Additional_Info are :
 [8 5 7 1 6 0 4 3 9 2]
The value counts of column Additional_Info are :
 8    10490
5     2426
7      396
0       20
4        8
3        5
6        3
1        1
9        1
2        1
Name: Additional_Info, dtype: int64

In [52]:
# Dropping the categorical columns from final_df.

final_df.drop(final_df.loc[:, ['Airline','Source','Destination','Additional_Info']], axis=1, inplace=True)

In [53]:
# Now merging data frames.

final_df = pd.concat([final_df,final_df1],axis=1,)

In [54]:
# Checking the top 5 rows of the columns again.

final_df.head()

,Total_Stops,Price,Date,Month,Year,Arrival_Hour,Arrival_Min,Departure_Hour,Departure_Min,Duration_Hour,Airline,Source,Destination,Additional_Info
0,0.0,3897.0,24,3,2019,1,10,22,20,2,3,0,5,8
1,2.0,7662.0,1,5,2019,13,15,5,50,7,1,3,0,8
2,2.0,13882.0,9,6,2019,4,25,9,25,19,4,2,1,8
3,1.0,6218.0,12,5,2019,23,30,18,5,5,3,3,0,8
4,1.0,13302.0,1,3,2019,21,35,16,50,4,3,0,5,8

In [56]:
# Checking the shape of the data set.

final_df.shape

(13351, 14)

In [ ]:
# Importing OneHotEncoder from sklearn.preprocessing

from sklearn.preprocessing import OneHotEncoder
ohe = OneHotEncoder()

In [57]:
final_df.columns

Index(['Total_Stops', 'Price', 'Date', 'Month', 'Year', 'Arrival_Hour',
       'Arrival_Min', 'Departure_Hour', 'Departure_Min', 'Duration_Hour',
       'Airline', 'Source', 'Destination', 'Additional_Info'],
      dtype='object')

In [59]:
# Performing onehotencoding using get_dummies function of pandas.

final_df = pd.get_dummies(final_df,columns=['Airline','Source','Destination','Additional_Info'],drop_first=True)

In [61]:
final_df.head()

,Total_Stops,Price,Date,Month,Year,Arrival_Hour,Arrival_Min,Departure_Hour,Departure_Min,Duration_Hour,...,Destination_5,Additional_Info_1,Additional_Info_2,Additional_Info_3,Additional_Info_4,Additional_Info_5,Additional_Info_6,Additional_Info_7,Additional_Info_8,Additional_Info_9
0,0.0,3897.0,24,3,2019,1,10,22,20,2,...,1,0,0,0,0,0,0,0,1,0
1,2.0,7662.0,1,5,2019,13,15,5,50,7,...,0,0,0,0,0,0,0,0,1,0
2,2.0,13882.0,9,6,2019,4,25,9,25,19,...,0,0,0,0,0,0,0,0,1,0
3,1.0,6218.0,12,5,2019,23,30,18,5,5,...,0,0,0,0,0,0,0,0,1,0
4,1.0,13302.0,1,3,2019,21,35,16,50,4,...,1,0,0,0,0,0,0,0,1,0